from main import main

# クレジットカードのテスト
main('クレジットカードの使える焼肉屋はありますか？\n和食の店でもクレカ使える？\n中華料理がいいかな\nカレー食べたくなった。クレカの使える店')

# 優先順位のテスト
main('紋別の飲食店は何かおすすめ？\nカラオケができるお店はある？\n一人で少しお酒がのめるのみやはある？\nジンギスカンが食べれるお店はある？\nおすすめのラーメン教えて\nおすすめのランチは？\nお蕎麦を食べたい\n')

# 言語のテスト
main("在紋別市有哪些推荐的寿司店？\n请用中文\n")
main("紋別市有哪些海鲜料理餐厅？\n请用中文\n")
main("在紋別市有没有5000日元以内的居酒屋推荐？\n请用中文\n")

main("What are the best sushi restaurants in Monbetsu?\n")
main("Are there any smoke-free dining options in Monbetsu?\n")
main("Can I find vegetarian or vegan options in Monbetsu's restaurants?\n")

main("紋別市でおすすめの寿司屋はどこですか？\n")
main("紋別市にはどのような海鮮料理のレストランがありますか？\n")
main("紋別市の居酒屋で、予算5,000円以内で楽しめるお店はありますか？\n")

main("寿司店？\n紋別市でおすすめの寿司屋はどこですか？\n")
main("寿司店？\n在紋別市有哪些推荐的寿司店？\n请用中文\n")

# 店名での検索のテスト
main("おすすめのスナックを教えてください。\nもんべろnetは何を紹介しているのですか？\nスナック ガリンコとはどんなお店？\n居酒屋ぶれいこうについて教えてください\n居酒屋ぶれいこうの営業時間について教えて\nクレジットカードが使える焼肉屋はありますか？\n今オホーツク空港にいます。おすすめの飲食店を教えて。\nカンパニオとオホーツク空港って結構離れてない？\nおすすめのイタリアンはある？\nおすすめ寿司屋はある？\n他におすすめの寿司屋はある？\n変わったメニューのお店はありますか？\nはまなす通りとは何？\n流氷とは何？\n美味しいイタリアンのお店\n美味しい焼肉のお店\n海鮮の美味しいお店\nホタテが食べられるお店\n日本酒の美味しいお店\nおすすめの飲食店は？")